app/Models/extra/DeklarModel.php

    public function distSelect($param, $kelompok = false)
    {
        $builder = $this->db->table('m_select');
        ($kelompok == false) ? $builder->select('*') : $builder->select('kelompok')->distinct();
        $builder->where('param', $param);
        $builder->orderBy('nomor');
        return $builder->get()->getResult();
---
SELECT *
FROM `m_select`
WHERE `param` = 'sistemsusut'
ORDER BY `nomor`

    public function getUser($menu, $atasan = false,  $aktif = false)
    {
        $builder = $this->db->table('m_user a');
        $builder->select('a.*, b.nama as role, c.nama as namauser, x.id as xlog');
        if ($atasan == true) $builder->where('a.atasan_id', $atasan);
        if ($aktif == true) $builder->where('a.is_confirm', '1')->where('a.is_aktif', '1');
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->join('m_role b', 'a.role_id = b.id', 'left');
        $builder->join('m_penerima c', 'a.id = c.user_id', 'left');
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->where(['a.deleted_at' => null]);
        $builder->groupby('a.id')->orderby('a.kode');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`nama` as `role`, `c`.`nama` as `namauser`, `x`.`id` as `xlog`
FROM `m_user` `a`
LEFT JOIN `m_role` `b` ON `a`.`role_id` = `b`.`id`
LEFT JOIN `m_penerima` `c` ON `a`.`id` = `c`.`user_id`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik`
WHERE `a`.`is_confirm` = '1'
AND `a`.`is_aktif` = '1'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`kode`

    public function getLog($username, $isi, $detil)
    {
        $builder = $this->db->table('log_data');
        $builder->where("(menu like \"%$isi%\" or data like \"%$isi%\")");
        if ($username != '') $builder->where('created_by', $username);
        if ($detil == '') $builder->where('is_show', '1');
        $builder->orderby('id desc');
        $builder->limit(10 * jllimit);
        return $builder->get()->getResult();
---
SELECT *
FROM `log_data`
WHERE (`menu` like "%%" or `data` like "%%")
AND `is_show` = '1'
ORDER BY `id` desc
 LIMIT 500

    public function getPerusahaan($menu, $aktif = false)
    {
        $builder = $this->db->table('m_perusahaan a');
        $builder->select('a.*, b.kode as kodepenerima, b.nama as namapenerima, x.id as xlog');
        if ($aktif == true) $builder->where('a.is_confirm', '1')->where('a.is_aktif', '1');
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->join('m_penerima b', 'b.id = a.penerima_id', 'left');
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->where(['a.deleted_at' => null]);
        $builder->groupBy('a.id')->orderby('a.kode');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`kode` as `kodepenerima`, `b`.`nama` as `namapenerima`, `x`.`id` as `xlog`
FROM `m_perusahaan` `a`
LEFT JOIN `m_penerima` `b` ON `b`.`id` = `a`.`penerima_id`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik`
WHERE `a`.`is_confirm` = '1'
AND `a`.`is_aktif` = '1'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`kode`

    public function getDivisi($menu, $pilihan, $aktif = false, $sdef = false)
    {
        $builder = $this->db->table('m_divisi a');
        $builder->select('a.*, x.id as xlog');
        if ($aktif == true) $builder->where('a.is_confirm', '1')->where('a.is_aktif', '1');
        if ($sdef == true) $builder->where('a.setdef', '1');
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->where('a.pilihan',  $pilihan)->where(['a.deleted_at' => null]);
        $builder->groupBy('a.id')->orderby('a.nama');
        return $builder->get()->getResult();
---
SELECT `a`.*, `x`.`id` as `xlog`
FROM `m_divisi` `a`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik`
WHERE `a`.`is_confirm` = '1'
AND `a`.`is_aktif` = '1'
AND `a`.`pilihan` = 'wilayah'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`nama`

    public function cekForm($pilihan, $form, $idunik = false, $aktif = '',  $perusahaan = '', $wilayah = '', $divisi = '')
    {
        $builder = $this->db->table('m_divisi');
        $builder->where('pilihan', $pilihan)->where('param', $form);
        $builder->where(['deleted_at' => null]);
        if ($perusahaan != '') $builder->where('perusahaan_id', $perusahaan);
        if ($wilayah != '') $builder->where('wilayah_id', $wilayah);
        if ($divisi != '') $builder->where('divisi_id', $divisi);
        if ($aktif == true) $builder->where('is_confirm', '1')->where('is_aktif', '1');
        if ($idunik == true) $builder->where('idunik !=', $idunik);
        return $builder->get()->getResult();
---
SELECT *
FROM `m_divisi`
WHERE `pilihan` = 'dokumen'
AND `param` = 'anggaranobjek'
AND `deleted_at` IS NULL
AND `idunik` != 't'

    public function distBiayalv1($pilihan)
    {
        $builder = $this->db->table('m_biaya');
        $builder->select('kode,nama')->distinct();
        $builder->where('pilihan', $pilihan)->where('level', '1');
        $builder->orderBy('kode');
        return $builder->get()->getResult();
---
SELECT DISTINCT `kode`, `nama`
FROM `m_biaya`
WHERE `pilihan` = 'btlangsung'
AND `level` = '1'
ORDER BY `kode`

    public function getAnggaran($menu, $dist = '1', $idunik = false, $tujuan = false, $pilihan = false, $jenis = false)
    {
        $builder = $this->db->table('m_anggaran a');
        $ordby = '';
        if ($dist == '1') {
            $builder->select('a.*, b.nama as jenisbiaya, x.id as xlog')->where('a.levsatu', '1');
            $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
            $builder->join('m_biaya b', 'a.jenis = b.kode',  'left');
            $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        } else {
            if (strlen($idunik) == 32) {
                if ($tujuan == 'proyek')
                    $builder->select('a.*, b.kode as kode, b.nama as deskripsi, b.level as level');
                else
                    $builder->select('a.*, c.noakun as kode, c.nama as deskripsi, c.level as level');
                $builder->where('a.idunik', $idunik);
                $builder->join('m_biaya b', 'a.biaya_id=b.id', 'left');
                $builder->join('m_akun c', 'a.akun_id=c.id', 'left');
                $ordby = ',b.kode, c.noakun, a.id';
            } else {
                $builder->where('a.pilihan', $pilihan)->where('a.tujuan', $tujuan);
            }
        }
        $builder->where(['a.deleted_at' => null]);
        $builder->groupBy('a.id')->orderby("a.pilihan, a.tujuan $ordby");
        return $builder->get()->getResult();
---
SELECT `a`.*, `c`.`noakun` as `kode`, `c`.`nama` as `deskripsi`, `c`.`level` as `level`
FROM `m_anggaran` `a`
LEFT JOIN `m_biaya` `b` ON `a`.`biaya_id`=`b`.`id`
LEFT JOIN `m_akun` `c` ON `a`.`akun_id`=`c`.`id`
WHERE `a`.`idunik` = '681a66871b8865ca406983c47f4003e8'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`pilihan`, `a`.`tujuan`, `b`.`kode`, `c`.`noakun`, `a`.`id`

    public function getCamp($menu, $aktif, $perusahaan = false, $divisi = false)
    {
        $builder = $this->db->table('m_camp a');
        $builder->select('a.*, b.kode as perusahaan, c.nama as wilayah, d.nama as divisi, x.id as xlog');
        if ($aktif != '') $builder->where('a.is_confirm', '1')->where('a.is_aktif', '1');
        if ($perusahaan == true) $builder->where('a.perusahaan_id', $perusahaan);
        if ($divisi == true) $builder->where('a.divisi_id', $divisi);
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_perusahaan b', 'a.perusahaan_id=b.id', 'left');
        $builder->join('m_divisi c', 'a.wilayah_id=c.id', 'left');
        $builder->join('m_divisi d', 'a.divisi_id=d.id', 'left');
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->groupBy('a.id')->orderby('kode');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`kode` as `perusahaan`, `c`.`nama` as `wilayah`, `d`.`nama` as `divisi`, `x`.`id` as `xlog`
FROM `m_camp` `a`
LEFT JOIN `m_perusahaan` `b` ON `a`.`perusahaan_id`=`b`.`id`
LEFT JOIN `m_divisi` `c` ON `a`.`wilayah_id`=`c`.`id`
LEFT JOIN `m_divisi` `d` ON `a`.`divisi_id`=`d`.`id`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik`
WHERE `a`.`is_confirm` = '1'
AND `a`.`is_aktif` = '1'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `kode`

    public function getRuas($menu, $pilih, $aktif = false, $proyek = false, $camp = false)
    {
        $builder = $this->db->table('m_ruas a');
        $builder->select('a.*,b.kode as kodeproyek, b.paket as namapaket, c.kode as perusahaan, d.nama as wilayah, g.nama as divisi, e.kode as kodecamp, e.nama as namacamp, f.kode as koderuas, f.nama as namaruas, x.id as xlog');
        $builder->where('a.pilihan', $pilih);
        if ($aktif != '') $builder->where('a.is_confirm', '1')->where('a.is_aktif', '1');
        if ($proyek == true) $builder->where('a.proyek_id', $proyek);
        if ($camp == true) $builder->where('a.camp_id', $camp);
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_proyek b', 'a.proyek_id=b.id', 'left');
        $builder->join('m_perusahaan c', 'b.perusahaan_id=c.id', 'left');
        $builder->join('m_divisi d', 'b.wilayah_id=d.id', 'left');
        $builder->join('m_divisi g', 'b.divisi_id=g.id', 'left');
        $builder->join('m_camp e', 'a.camp_id=e.id', 'left');
        $builder->join('m_ruas f', 'a.ruas_id=f.id', 'left');
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->groupBy('a.id')->orderby('b.kode,a.kode');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`kode` as `kodeproyek`, `b`.`paket` as `namapaket`, `c`.`kode` as `perusahaan`, `d`.`nama` as `wilayah`, `g`.`nama` as `divisi`, `e`.`kode` as `kodecamp`, `e`.`nama` as `namacamp`, `f`.`kode` as `koderuas`, `f`.`nama` as `namaruas`, `x`.`id` as `xlog`
FROM `m_ruas` `a`
LEFT JOIN `m_proyek` `b` ON `a`.`proyek_id`=`b`.`id`
LEFT JOIN `m_perusahaan` `c` ON `b`.`perusahaan_id`=`c`.`id`
LEFT JOIN `m_divisi` `d` ON `b`.`wilayah_id`=`d`.`id`
LEFT JOIN `m_divisi` `g` ON `b`.`divisi_id`=`g`.`id`
LEFT JOIN `m_camp` `e` ON `a`.`camp_id`=`e`.`id`
LEFT JOIN `m_ruas` `f` ON `a`.`ruas_id`=`f`.`id`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik` AND `x`.`menu` = "subruas" AND `x`.`created_by` = "Administrator"
WHERE `a`.`pilihan` = 'subruas'
AND `a`.`camp_id` = '-'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `b`.`kode`, `a`.`kode`

    public function getKelakun($submenu, $kelompok, $menu = false)
    {
        $builder = $this->db->table('def_akun');
        $builder->where('submenu', $submenu);
        if ($kelompok != '') $builder->where('kelompok', $kelompok);
        if ($menu == true) $builder->where('menu', $menu);
        $builder->where('is_confirm', '1')->where('is_aktif', '1')->where(['deleted_at' => null]);
        $builder->orderby('nama');
        return $builder->get()->getResult();
---
SELECT *
FROM `def_akun`
WHERE `submenu` = 'aset'
AND `kelompok` = 'inventaris'
AND `is_confirm` = '1'
AND `is_aktif` = '1'
AND `deleted_at` IS NULL
ORDER BY `nama`

    public function getBarang($menu, $pilihan, $kategori = false, $serial = false)
    {
        $builder = $this->db->table('m_barang a');
        $builder->select('a.*, x.id as xlog');
        $builder->where('a.pilihan', $pilihan);
        if ($kategori == true) $builder->where('kategori', $kategori);
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->groupBy('a.id')->orderby('a.kategori,a.kode');
        return $builder->get()->getResult();
---
SELECT `a`.*, `x`.`id` as `xlog`
FROM `m_barang` `a`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik`
WHERE `a`.`pilihan` = 'barang'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`kategori`, `a`.`kode`

    public function getSerial($menu, $barang)
    {
        $builder = $this->db->table('m_serial a');
        $builder->select('a.*, b.kode as kodebrg, b.nama as barang, c.kode as kodealat, c.nomor as nomoralat, c.nama as namaalat, x.id as xlog');
        if ($barang != '') $builder->where('a.barang_id', $barang);
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_barang b', 'a.barang_id=b.id', 'left');
        $builder->join('m_alat c', 'a.alat_id=c.id', 'left');
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->groupBy('a.id')->orderby('b.kode,a.noseri');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`kode` as `kodebrg`, `b`.`nama` as `barang`, `c`.`kode` as `kodealat`, `c`.`nomor` as `nomoralat`, `c`.`nama` as `namaalat`, `x`.`id` as `xlog`
FROM `m_serial` `a`
LEFT JOIN `m_barang` `b` ON `a`.`barang_id`=`b`.`id`
LEFT JOIN `m_alat` `c` ON `a`.`alat_id`=`c`.`id`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik` AND `x`.`menu` = "noseri" AND `x`.`created_by` = "Administrator"
WHERE `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `b`.`kode`, `a`.`noseri`