app/Models/extra/IdunikModel.php

SELECT *
FROM `m_idunik`
WHERE `idunik` = 'f522b466f873f54716f0c165aa44a302'
 LIMIT 1
---
    public function cekID($data)
    {
        return $this->where(['idunik' => $data])->first();