app/Models/extra/LogModel.php

INSERT INTO `log_data` (`menu`, `aksi`, `idunik`, `is_show`, `data`, `ip_address`, `created_by`, `created_at`, `updated_at`) VALUES ('tautp', 'Read', 'a1420e1f98afd98dadce6e6e9f2e3984', '-', 'Pebana ; PT. Pebana Adi Sarana', '::1', 'Administrator', '2024-08-21 21:08:45', '2024-08-21 21:08:45')
---
    public function saveLog($aksi, $idunik, $data, $show = '1')
    {
        $this->save([
            'menu' => $this->urls[1],
            'aksi' => $aksi,
            'idunik' => $idunik,
            'is_show' => $show,
            'data' => $data,
            'ip_address' => session()->ipaddress ?? '',
            'created_by' => session()->username ?? '',
        ]);