app/Models/extra/TranModel.php

    public function getAnggaraninduk($menu, $perusahaan, $wilayah, $divisi, $tahun, $pilih, $tujuan)
    {
        $builder = $this->db->table('anggaran_induk a');
        $builder->select('a.*, b.total_kontrak_cco as totallev1, c.kode as perusahaan, d.nama as wilayah, e.nama as divisi, f.kode as proyek, f.paket as paketproyek, f.periode1 as tahunproyek,
            g.kode as ruas, g.nama as namaruas, h.kode as camp, h.nama as namacamp, j.kode as alat, j.nomor as nomoralat, j.nama as namaalat, k.kode as tanah, k.nama as namatanah, x.id as xlog');
        if ($perusahaan != '') $builder->where('a.perusahaan_id', $perusahaan);
        if ($wilayah != '') $builder->where('a.wilayah_id', $wilayah);
        if ($divisi != '') $builder->where('a.divisi_id', $divisi);
        if ($tahun != '') ($tujuan == 'proyek' ? $builder->where("(f.periode1 like \"%$tahun%\")") : $builder->where("(a.tanggal1 like \"%$tahun%\")"));
        if ($pilih != '') $builder->where('a.pilihan', $pilih);
        ($menu == 'anggobjek') ? $builder->where(['a.ruas_id' => null]) : $builder->where(['a.ruas_id !=' => null]);
        $builder->where('a.tujuan', $tujuan);
        // $builder->where('b.levsatu', '1')->whereIn('a.is_use', ['0', '1']);
        $builder->where('b.levsatu', '1');
        $strx = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.created_by = "' . session()->username . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('anggaran_anak b', 'a.id=b.anggaraninduk_id', 'left');
        $builder->join('m_perusahaan c', 'a.perusahaan_id=c.id', 'left');
        $builder->join('m_divisi d', 'a.wilayah_id=d.id', 'left');
        $builder->join('m_divisi e', 'a.divisi_id=e.id', 'left');
        $builder->join('m_proyek f', 'a.beban_id=f.id', 'left');
        $builder->join('m_ruas g', 'a.ruas_id=g.id', 'left');
        $builder->join('m_camp h', 'a.beban_id=h.id', 'left');
        $builder->join('m_alat j', 'a.beban_id=j.id', 'left');
        $builder->join('m_tanah k', 'a.beban_id=k.id', 'left');
        $builder->join('log_data x', 'x.idunik = a.idunik' . $strx, 'left');
        $builder->groupBy('a.id')->orderby('a.nodoc, a.beban_id, a.ruas_id, a.adendum, a.revisi');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`total_kontrak_cco` as `totallev1`, `c`.`kode` as `perusahaan`, `d`.`nama` as `wilayah`, `e`.`nama` as `divisi`, `f`.`kode` as `proyek`, `f`.`paket` as `paketproyek`, `f`.`periode1` as `tahunproyek`, `g`.`kode` as `ruas`, `g`.`nama` as `namaruas`, `h`.`kode` as `camp`, `h`.`nama` as `namacamp`, `j`.`kode` as `alat`, `j`.`nomor` as `nomoralat`, `j`.`nama` as `namaalat`, `k`.`kode` as `tanah`, `k`.`nama` as `namatanah`, `x`.`id` as `xlog`
FROM `anggaran_induk` `a`
LEFT JOIN `anggaran_anak` `b` ON `a`.`id`=`b`.`anggaraninduk_id`
LEFT JOIN `m_perusahaan` `c` ON `a`.`perusahaan_id`=`c`.`id`
LEFT JOIN `m_divisi` `d` ON `a`.`wilayah_id`=`d`.`id`
LEFT JOIN `m_divisi` `e` ON `a`.`divisi_id`=`e`.`id`
LEFT JOIN `m_proyek` `f` ON `a`.`beban_id`=`f`.`id`
LEFT JOIN `m_ruas` `g` ON `a`.`ruas_id`=`g`.`id`
LEFT JOIN `m_camp` `h` ON `a`.`beban_id`=`h`.`id`
LEFT JOIN `m_alat` `j` ON `a`.`beban_id`=`j`.`id`
LEFT JOIN `m_tanah` `k` ON `a`.`beban_id`=`k`.`id`
LEFT JOIN `log_data` `x` ON `x`.`idunik` = `a`.`idunik` AND `x`.`menu` = "anggobjek" AND `x`.`created_by` = "Administrator"
WHERE `a`.`perusahaan_id` = '2'
AND `a`.`divisi_id` = '3'
AND (`a`.`tanggal1` like "%2024%")
AND `a`.`ruas_id` IS NULL
AND `a`.`tujuan` = 'pilih-'
AND `b`.`levsatu` = '1'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`nodoc`, `a`.`beban_id`, `a`.`ruas_id`, `a`.`adendum`, `a`.`revisi`

    public function getAnggarananak($induk, $kategori, $level = false)
    {
        $builder = $this->db->table('anggaran_anak a');
        $builder->select('a.*, b.noakun as noakun, b.nama as namaakun, b.level as levelakun, c.kode as biaya, c.nama as namabiaya, c.matabayar as matabayar, c.satuan as satuan, c.level as levelbiaya');
        $builder->where('a.anggaraninduk_id', $induk)->where(['a.deleted_at' => null]);
        if ($kategori != '') $builder->where('c.tipe_id', $kategori);
        $builder->join('m_akun b', 'a.akun_id = b.id', 'left');
        $builder->join('m_biaya c', 'a.biaya_id = c.id', 'left');
        $builder->orderby('b.noakun, c.kode, a.id');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`noakun` as `noakun`, `b`.`nama` as `namaakun`, `b`.`level` as `levelakun`, `c`.`kode` as `biaya`, `c`.`nama` as `namabiaya`, `c`.`matabayar` as `matabayar`, `c`.`satuan` as `satuan`, `c`.`level` as `levelbiaya`
FROM `anggaran_anak` `a`
LEFT JOIN `m_akun` `b` ON `a`.`akun_id` = `b`.`id`
LEFT JOIN `m_biaya` `c` ON `a`.`biaya_id` = `c`.`id`
WHERE `a`.`anggaraninduk_id` = ''
AND `a`.`deleted_at` IS NULL
ORDER BY `b`.`noakun`, `c`.`kode`, `a`.`id`

    public function loadAnggaran($tujuan, $ruas, $beban, $tipe, $tanggal)
    {
        $builder = $this->db->table('anggaran_anak a');
        $builder->select('a.*, e.id as idbiaya, e.kode as kodebiaya, e.nama as namabiaya, e.akun_id as akunbiaya, f.id as idakun, f.noakun as noakun, f.nama as namaakun');
        $builder->where('b.tujuan', $tujuan)->where('b.beban_id', $beban);
        // $builder->where('b.is_use', '1')->where(['b.deleted_at' => null]);
        // $builder->where('a.tanggal BETWEEN "' . date('Y-m-d', strtotime($awal)) . '" and "' . date('Y-m-d', strtotime($akhir)) . '"');
        if ($ruas != '') { //level 3
            $builder->where('b.ruas_id', $ruas)->where('c.tipe_id', $tipe); //proyek
            $builder->where('e.level', '3');
        } else {
            ($tujuan == 'proyek' ? $builder->where('e.level', '4') : $builder->where('f.level', '4'));
        }
        $builder->join('anggaran_induk b', 'a.anggaraninduk_id=b.id', 'left');
        $builder->join('m_proyek c', 'b.beban_id=c.id', 'left');
        $builder->join('m_biaya e', 'a.biaya_id=e.id', 'left');
        $builder->join('m_akun f', 'a.akun_id=f.id', 'left');
        ($tujuan == 'proyek') ? $builder->orderby('e.kode') : $builder->orderby('f.noakun');
        return $builder->get()->getResult();
---
SELECT `a`.*, `e`.`id` as `idbiaya`, `e`.`kode` as `kodebiaya`, `e`.`nama` as `namabiaya`, `e`.`akun_id` as `akunbiaya`, `f`.`id` as `idakun`, `f`.`noakun` as `noakun`, `f`.`nama` as `namaakun`
FROM `anggaran_anak` `a`
LEFT JOIN `anggaran_induk` `b` ON `a`.`anggaraninduk_id`=`b`.`id`
LEFT JOIN `m_proyek` `c` ON `b`.`beban_id`=`c`.`id`
LEFT JOIN `m_biaya` `e` ON `a`.`biaya_id`=`e`.`id`
LEFT JOIN `m_akun` `f` ON `a`.`akun_id`=`f`.`id`
WHERE `b`.`tujuan` = ''
AND `b`.`beban_id` = ''
AND `f`.`level` = '4'
ORDER BY `f`.`noakun`