app/Models/file/LampiranModel.php

SELECT `a`.*, `b`.`kode` as `user`
FROM `m_lampiran` `a`
LEFT JOIN `m_user` `b` ON `a`.`updated_by` = `b`.`id`
WHERE `a`.`pilihan` = 'perusahaan'
AND `a`.`idunik` = 'a1420e1f98afd98dadce6e6e9f2e3984'
ORDER BY `a`.`judul`
---
    public function getLampiran($pilihan, $idunik)
    {
        $query = $this->db->table('m_lampiran a');
        $query->select('a.*, b.kode as user');
        $query->join('m_user b', 'a.updated_by = b.id', 'left');
        $query->where('a.pilihan', $pilihan)->where(['a.idunik' => $idunik]);
        $query->orderby('a.judul');
        return $query->get()->getResultArray();