app/Models/admin/KonfigurasiModel.php

    public function getKonfigurasi($parameter = false)
    {
        $query = $this->db->table('m_konfigurasi');
        $query->select('m_konfigurasi.*, m_user.kode as user');
        $query->join('m_user', 'm_konfigurasi.updated_by = m_user.id', 'left');
        if ($parameter !== false) $query->where('m_konfigurasi.parameter', $parameter);
        return $query->get()->getResultArray();
---
SELECT `m_konfigurasi`.*, `m_user`.`kode` as `user`
FROM `m_konfigurasi`
LEFT JOIN `m_user` ON `m_konfigurasi`.`updated_by` = `m_user`.`id`
WHERE `m_konfigurasi`.`parameter` = 'konf_jlsetuju'