app/Models/admin/RoleModel.php

SELECT *
FROM `m_role`
WHERE `id` = '1'
AND `m_role`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getRole($id)
    {
        return $this->where(['id' => $id])->first();