app/Models/admin/UserModel.php

SELECT `m_user`.*, `m_penerima`.`id` as `idpeg`, `m_penerima`.`kode` as `kodepeg`, `m_penerima`.`nip` as `nippeg`, `m_penerima`.`nama` as `namapeng`, `m_penerima`.`is_confirm` as `confpeg`, `m_penerima`.`is_aktif` as `akpeg`
FROM `m_user`
LEFT JOIN `m_penerima` ON `m_user`.`id` = `m_penerima`.`user_id`
WHERE `m_user`.`is_confirm` = '1'
AND `m_user`.`is_aktif` = '1'
AND `m_user`.`kode` = 'Administrator'
AND `m_user`.`deleted_at` IS NULL
---
    public function getUser($username)
    {
        return $this->db->table('m_user')
            ->select('m_user.*, m_penerima.id as idpeg, m_penerima.kode as kodepeg, m_penerima.nip as nippeg, m_penerima.nama as namapeng, m_penerima.is_confirm as confpeg, m_penerima.is_aktif as akpeg')
            ->join('m_penerima', 'm_user.id = m_penerima.user_id', 'left')
            ->where('m_user.is_confirm', '1')->where('m_user.is_aktif', '1')->where('m_user.kode', $username)
            ->where('m_user.deleted_at', null)
            ->get()->getRowArray();